src/Documents/УстановкаОсобыхУсловийОтсрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаОсобыхУсловийОтсрочки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОсобыеУсловияОтсрочки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовителиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоставкиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсобыеУсловия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Изготовитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимоеЧислоДнейЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчетаДней</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыРасчетаДней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УстановкаОсобыхУсловийОтсрочки/Ext/ManagerModule.bsl
Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ОсобыеУсловияОтсрочки") Тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ОсобыеУсловияОтсрочки", РегистрыСведений_ОсобыеУсловияОтсрочки(вхСсылкаНаДокумент, вхОтказ));
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОтменуПроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если НЕ вхОтказ Тогда
		ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент);
	КонецЕсли;
		
КонецПроцедуры

Функция РегистрыСведений_ОсобыеУсловияОтсрочки(вхСсылкаНаДокумент, вхОтказ) 
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраСведений("ОсобыеУсловияОтсрочки", ТаблицаДвижений);
	ДатаОкончания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "ДатаОкончания");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	НАЧАЛОПЕРИОДА(УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.Дата, ДЕНЬ) КАК Период,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка КАК Регистратор,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Изготовитель,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ТипПоставки,
	                |	СУММА(УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ДопустимоеЧислоДнейЗадолженности) КАК ДопустимоеЧислоДнейЗадолженности,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ВидРасчетаДней,
	                |	ВЫБОР
	                |		КОГДА УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	                |			ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	                |		ИНАЧЕ УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДатаОкончания
	                |	КОНЕЦ КАК ДатаОкончания
	                |ИЗ
	                |	Документ.УстановкаОсобыхУсловийОтсрочки.ОсобыеУсловия КАК УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия
	                |ГДЕ
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Изготовитель,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ВидРасчетаДней,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ТипПоставки,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДоговорКонтрагента,
	                |	НАЧАЛОПЕРИОДА(УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.Дата, ДЕНЬ),
	                |	ВЫБОР
	                |		КОГДА УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	                |			ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	                |		ИНАЧЕ УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДатаОкончания
	                |	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	
КонецФункции
